---

C#Visual BasicVisual C++

Revit 2024 API
---
ViewActivatingEventArgs..::..CurrentActiveView Property
ViewActivatingEventArgs Class See Also Send Feedback
---

The view that is currently active.

**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010

# Syntax

C#
---

    public View CurrentActiveView { get; }

Visual Basic
---

    Public ReadOnly Property CurrentActiveView As View
    	Get

Visual C++
---

    public:
    property View^ CurrentActiveView {
    	View^ get ();
    }

# Remarks

May be nullNothingnullptra null reference (Nothing in Visual Basic) if there is no currently active view.

# See Also

ViewActivatingEventArgs Class

Autodesk.Revit.UI.Events Namespace